{
    "Lima": [
      "Try local ceviche by the coast.",
      "Take a walk along the Miraflores boardwalk.",
      "Avoid rush hour traffic if using taxis."
    ],
    "Cusco": [
      "Acclimate for a day before going to Machu Picchu.",
      "Visit San Pedro Market for authentic souvenirs.",
      "Drink coca tea to help with the altitude."
    ],
    "Arequipa": [
      "Explore the Colca Canyon for stunning views.",
      "Bring sunscreen—sun is strong at altitude.",
      "Don’t miss the alpaca dishes and local cheeses."
    ],
    "Piura": [
      "Visit the beautiful Mancora beach for surfing and relaxation.",
      "Try the local seafood, especially the ceviche and the 'seco de chabelo.'",
      "Take a trip to the nearby Catacaos market to shop for traditional crafts and jewelry.",
      "Explore the historical city center with its colonial architecture and charming squares."
    ],
    "Ica": [
      "Don't miss the Huacachina Oasis, where you can try sandboarding on the dunes.",
      "Visit the famous Pisco wineries and enjoy a tasting of Peru's national drink.",
      "Take a boat trip to the Ballestas Islands to see wildlife such as sea lions and penguins.",
      "Explore the Nazca Lines from an aerial tour to marvel at these ancient geoglyphs."
    ],
    "Chiclayo": [
      "Visit the Lord of Sipán Tombs at the Royal Tombs of Sipán Museum for an insight into ancient Moche culture.",
      "Try the 'ceviche de conchas negras' (black clam ceviche) – a local delicacy.",
      "Explore the colorful Mercado Modelo for a taste of local life and food.",
      "Take a day trip to the archaeological site of Tucume, known for its pyramid structures."
    ],
    "Iquitos": [
      "Explore the Amazon Rainforest by boat and immerse yourself in nature.",
      "Take a guided jungle tour to learn about local flora and fauna.",
      "Try local dishes like 'tacacho con cecina' (fried plantain and dried meat) and 'juanes' (rice and chicken wrapped in leaves).",
      "Visit the famous Belén Market to see the variety of exotic products and traditional goods."
    ],

    "Trujillo": [
        "Visit the ancient city of Chan Chan, the largest adobe city in the world.",
        "Don't miss the Huanchaco beach—famous for its surf and reed boats.",
        "Try local dishes like shambar and cabrito norteño."
      ],
      "Tacna": [
        "Explore the Tacna Cathedral and the historic Paseo Cívico.",
        "Visit the Miculla petroglyphs for ancient rock carvings.",
        "Enjoy local wines and pisco from the nearby valleys."
      ],
      "Puno": [
        "Take a boat tour of Lake Titicaca and the Uros floating islands.",
        "Attend the Festival de la Virgen de la Candelaria if you're around in February.",
        "Dress warmly—nights can be very cold due to high altitude."
      ],
      "Chimbote": [
        "Sample fresh seafood, especially ceviche and fish stews.",
        "Visit the nearby Tortugas Beach for a relaxing day trip.",
        "Hike to Cerro de la Juventud for panoramic views of the city."
      ],
      "Huancayo": [
        "Ride the central train from Lima for a scenic experience.",
        "Visit the Wari ruins and the Torre Torre formations.",
        "Try pachamanca, a traditional Andean meal cooked underground."
      ],
      "Juliaca": [
        "Use Juliaca as a gateway to Lake Titicaca and Puno.",
        "Explore the Santa Catalina Church and local markets.",
        "Bring layers—weather can change quickly at altitude."
      ],
      
      "Huanuco": [
        "Discover the Kotosh archaeological site just outside the city.",
        "Explore the nearby Tingo María National Park.",
        "Don’t forget insect repellent—especially near the jungle zones."
      ],
      "Tarapoto": [
        "Visit waterfalls like Ahuashiyacu and explore the Amazon jungle.",
        "Try exotic Amazonian dishes like juane and tacacho con cecina.",
        "Book a tour to Laguna Azul for a relaxing nature escape."
      ],
      "Moquegua": [
        "Sample local wines and piscos at regional bodegas.",
        "Visit the Museo Contisuyo for regional history and artifacts.",
        "Stroll through the picturesque Plaza de Armas."
      ],
      "Abancay": [
        "Hike to the Ampay National Sanctuary for natural beauty.",
        "Visit colonial churches and try local Andean dishes.",
        "Enjoy the quiet atmosphere—great for a calm getaway."
      ],
      "Tumbes": [
        "Relax on Punta Sal beach and visit the Manglares de Tumbes.",
        "Try delicious seafood and tropical fruits.",
        "Don’t miss Zorritos’ hot springs for a soak."
      ],
      "Cajamarca": [
        "Tour the Ransom Room, where Inca history meets the Spanish conquest.",
        "Soak in the Baños del Inca hot springs.",
        "Try manjar blanco and local cheeses."
      ],
      "Ayacucho": [
        "Admire colonial churches and the city’s vibrant Semana Santa celebration.",
        "Visit the Wari ruins and Pampa de Ayacucho battlefield.",
        "Buy handmade crafts and retablos from local artisans."
      ]
    }
    
    
       